In [17]:
people = {
    "first": ["Kiyo", 'Jane', 'John'], 
    "last": ["Ndux", 'Doe', 'Doe'], 
    "email": ["rmvilla987@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [18]:
import pandas as pd

In [19]:
df = pd.DataFrame(people)

In [ ]:
df

In [21]:
df['first'] + ' ' + df['last']

0    Kiyo Ndux
1     Jane Doe
2     John Doe
dtype: object

In [22]:
df['full_name'] = df['first'] + ' ' + df['last']

df

In [24]:
df.drop(columns=['first','last'], inplace=True)

In [25]:
df

                  email  full_name
0  rmvilla987@gmail.com  Kiyo Ndux
1     JaneDoe@email.com   Jane Doe
2     JohnDoe@email.com   John Doe

In [26]:
df['full_name'].str.split(' ',expand=True)

      0     1
0  Kiyo  Ndux
1  Jane   Doe
2  John   Doe

In [27]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [28]:
df

                  email  full_name first  last
0  rmvilla987@gmail.com  Kiyo Ndux  Kiyo  Ndux
1     JaneDoe@email.com   Jane Doe  Jane   Doe
2     JohnDoe@email.com   John Doe  John   Doe

In [31]:
new_row = pd.DataFrame([{'first': 'Tony'}])
df = pd.concat([df, new_row], ignore_index=True)

In [32]:
df

                  email  full_name first  last
0  rmvilla987@gmail.com  Kiyo Ndux  Kiyo  Ndux
1     JaneDoe@email.com   Jane Doe  Jane   Doe
2     JohnDoe@email.com   John Doe  John   Doe
3                   NaN        NaN  Tony   NaN

In [33]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["ironman@avenge.com", 'cap@avenge.com']
}

In [34]:
df2 = pd.DataFrame(people)

In [35]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [38]:
df = pd.concat([df, df2], ignore_index=True)

In [39]:
df

                  email  full_name  first    last
0  rmvilla987@gmail.com  Kiyo Ndux   Kiyo    Ndux
1     JaneDoe@email.com   Jane Doe   Jane     Doe
2     JohnDoe@email.com   John Doe   John     Doe
3                   NaN        NaN   Tony     NaN
4    ironman@avenge.com        NaN   Tony   Stark
5        cap@avenge.com        NaN  Steve  Rogers

In [41]:
df.drop(index=5)

                  email  full_name first   last
0  rmvilla987@gmail.com  Kiyo Ndux  Kiyo   Ndux
1     JaneDoe@email.com   Jane Doe  Jane    Doe
2     JohnDoe@email.com   John Doe  John    Doe
3                   NaN        NaN  Tony    NaN
4    ironman@avenge.com        NaN  Tony  Stark

In [43]:
filt = df['last']== 'Doe'
df.drop(index=df[filt].index)

                  email  full_name  first    last
0  rmvilla987@gmail.com  Kiyo Ndux   Kiyo    Ndux
3                   NaN        NaN   Tony     NaN
4    ironman@avenge.com        NaN   Tony   Stark
5        cap@avenge.com        NaN  Steve  Rogers